astb_relise/src/Documents/Уведомление/Уведомление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Уведомление</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстУведомления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.ВидыУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

astb_relise/src/Documents/Уведомление/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ОтправитьУведомлениеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Модифицированность Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Перед отправкой уведомления необходимо записать документ!";
			СообщениеПользователю.Сообщить();
		Иначе
			Уведомление = Новый ДоставляемоеУведомление;
			Уведомление.Данные = "ОбратнаяСвязь";
			Уведомление.Текст = "Обработано Ваше обращение №" + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
			ОтправкаPUSHВызовСервера.ОтправитьУведомление(Уведомление,Объект.СоздательДокумента.ОбъектАвторизации, Объект.ВидУведомления);
			Объект.Отправлено = Истина;
			Модифицированность = Истина;
		КонецЕсли;
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Перед отправкой уведомления необходимо записать документ!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомление(Команда)
	
	ОтправитьУведомлениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтправитьУведомление.Доступность = НЕ Объект.Отправлено;
	
КонецПроцедуры
